{
  "termination notice period": "Either party may terminate this Agreement by providing ninety (90) days prior written notice to the other party. Upon termination, all obligations shall cease except for those that by their nature survive termination, including confidentiality, indemnification, and payment obligations. The terminating party shall provide written notice via certified mail or email to the designated contact person. Early termination fees may apply if terminated before the initial term expires.",
  "payment terms": "Payment shall be due within thirty (30) days of invoice date. All invoices shall be submitted electronically to the designated billing contact. Late payments shall accrue interest at a rate of 1.5% per month or the maximum rate permitted by law, whichever is lower. Client agrees to pay all reasonable collection costs, including attorney fees, incurred in collecting overdue amounts. Disputed invoices must be raised in writing within fifteen (15) days of receipt.",
  "governing law": "This Agreement shall be governed by and construed in accordance with the laws of the Republic of Mauritius, without regard to its conflict of laws principles. The parties hereby submit to the exclusive jurisdiction of the courts of Mauritius for any legal proceedings arising out of this Agreement. Either party may seek injunctive relief in any court of competent jurisdiction to protect its confidential information or intellectual property rights.",
  "amendment and waiver": "This Agreement may not be amended, modified, or supplemented except by a written instrument signed by authorized representatives of both parties. No waiver of any provision shall be effective unless in writing and signed by the waiving party. The failure of either party to enforce any right or provision shall not constitute a waiver. Any waiver shall be limited to the specific instance and shall not affect any other rights or remedies.",
  "confidentiality agreement": "Each party agrees to maintain the confidentiality of all Confidential Information disclosed by the other party. Confidential Information includes, but is not limited to, trade secrets, business plans, customer lists, financial data, technical specifications, and proprietary methodologies. The receiving party shall use the same degree of care to protect Confidential Information as it uses to protect its own confidential information, but no less than reasonable care. This obligation shall survive termination for five (5) years.",
  "force majeure": "Neither party shall be liable for any failure or delay in performing its obligations if such failure results from circumstances beyond reasonable control, including acts of God, natural disasters, war, terrorism, riots, embargoes, fire, floods, epidemics, pandemics, strikes, or failures of transportation or communication systems. The affected party shall provide prompt written notice and use reasonable efforts to mitigate the impact and resume performance as soon as practicable.",
  "liability limitation": "Neither party shall be liable for any indirect, incidental, special, consequential, or punitive damages, including loss of profits, revenue, data, or business opportunities. The total aggregate liability of either party under this Agreement shall not exceed the total fees paid or payable during the twelve (12) month period preceding the claim. This limitation shall not apply to breaches of confidentiality, gross negligence, or willful misconduct."
}